STMicroelectronics/STM32CubeWB0/Projects/NUCLEO-WB07CC/Applications/BLE/BLE_MultipleConnections_CP/STM32_BLE/App/mc_centralperipheral_app.c
/* USER CODE BEGIN Header */
/**
******************************************************************************
* @file    MC_CentralPeripheral_app.c
* @author  MCD Application Team
* @brief   MC_CentralPeripheral_app application definition.
******************************************************************************
* @attention
*
* Copyright (c) 2024 STMicroelectronics.
* All rights reserved.
*
* This software is licensed under terms that can be found in the LICENSE file
* in the root directory of this software component.
* If no LICENSE file comes with this software, it is provided AS-IS.
*
******************************************************************************
*/
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "app_common.h"
#include "app_ble.h"
#include "ble.h"
#include "mc_centralperipheral_app.h"
#include "mc_centralperipheral.h"
#include "stm32_seq.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "gatt_client_app.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/

/* USER CODE BEGIN PTD */
typedef struct{
  uint8_t             Device_Led_Selection;
  uint8_t             Led1;
}P2P_LedCharValue_t;

typedef struct{
  uint8_t             Device_Button_Selection;
  uint8_t             ButtonStatus;
}P2P_ButtonCharValue_t;

typedef struct{
  uint16_t             connectionHandle;
  /*
  0x00   init
  0x01   paring request to be done
  0x02   paring request done
  0x03   paring request fail
  0x04   paring request success
  0x05   paring request 0x03 error
  */
  uint8_t             pairing_status;
}ContextData_t;


/* USER CODE END PTD */

typedef enum
{
  Switch_c_NOTIFICATION_OFF,
  Switch_c_NOTIFICATION_ON,
  /* USER CODE BEGIN Service1_APP_SendInformation_t */
  
  /* USER CODE END Service1_APP_SendInformation_t */
  MC_CENTRALPERIPHERAL_APP_SENDINFORMATION_LAST
} MC_CENTRALPERIPHERAL_APP_SendInformation_t;

typedef struct
{
  MC_CENTRALPERIPHERAL_APP_SendInformation_t     Switch_c_Notification_Status;
  uint16_t MC_CENTRALPERIPHERAL_periph_connHdl;
  /* USER CODE BEGIN Service1_APP_Context_t */

  ContextData_t central_array[CFG_BLE_NUM_CLIENT_CONTEXTS];
  ContextData_t peripheral_array[CFG_BLE_PERIPHERAL_HANDLES_MAX];
  
  P2P_LedCharValue_t              LedControl;
  P2P_ButtonCharValue_t           ButtonControl;
  /* USER CODE END Service1_APP_Context_t */
  uint16_t              ConnectionHandle;
} MC_CENTRALPERIPHERAL_APP_Context_t;

/* Private defines -----------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* External variables --------------------------------------------------------*/
/* USER CODE BEGIN EV */

/* USER CODE END EV */

/* Private macros ------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
static MC_CENTRALPERIPHERAL_APP_Context_t MC_CENTRALPERIPHERAL_APP_Context;

uint8_t a_MC_CENTRALPERIPHERAL_UpdateCharData[247];

/* USER CODE BEGIN PV */

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
static void MC_CENTRALPERIPHERAL_Switch_c_SendNotification(void);

/* USER CODE BEGIN PFP */
static void MC_CENTRALPERIPHERAL_APP_LED_BUTTON_context_Init(void);
void APP_Context_init(void);
int APP_Context_getActiveConnectionCount(ContextData_t* contextData_Array, int maxHandles);
int APP_Context_findFirstFreeIndex(ContextData_t* connHdlArray, int maxHandles);
int APP_Context_addConnection(MC_CENTRALPERIPHERAL_APP_Context_t* context, uint16_t connHdl, int isRolePeripheral);
int APP_Context_removeConnection(MC_CENTRALPERIPHERAL_APP_Context_t* context, uint16_t connHdl, int isRolePeripheral);
int APP_Context_updatePairingStatus(uint16_t connHdl, uint8_t newStatus);
int APP_Context_isConnectionHandle(MC_CENTRALPERIPHERAL_APP_Context_t* context, uint16_t connHdl, int isRolePeripheral);
int APP_Context_isCentralConnectionHandle(uint16_t connHdl);
int APP_Context_isPeripheralConnectionHandle(uint16_t connHdl);
void APP_Context_printContextArrays(void);
static void Peripheral_Security_Request(void);
static void Terminate_Connections(MC_CENTRALPERIPHERAL_APP_Context_t* context, int isRolePeripheral);
static void Terminate_Central_Connections(void);
static void Terminate_Peripheral_Connections(void);
/* USER CODE END PFP */

/* Functions Definition ------------------------------------------------------*/
void MC_CENTRALPERIPHERAL_Notification(MC_CENTRALPERIPHERAL_NotificationEvt_t *p_Notification)
{
  /* USER CODE BEGIN Service1_Notification_1 */
  
  /* USER CODE END Service1_Notification_1 */
  switch(p_Notification->EvtOpcode)
  {
    /* USER CODE BEGIN Service1_Notification_Service1_EvtOpcode */
    
    /* USER CODE END Service1_Notification_Service1_EvtOpcode */

    case MC_CENTRALPERIPHERAL_LED_C_READ_EVT:
      /* USER CODE BEGIN Service1Char1_READ_EVT */
    
      /* USER CODE END Service1Char1_READ_EVT */
      break;

    case MC_CENTRALPERIPHERAL_LED_C_WRITE_NO_RESP_EVT:
      /* USER CODE BEGIN Service1Char1_WRITE_NO_RESP_EVT */
    if(p_Notification->DataTransfered.p_Payload[1] == 0x01)
    {
      BSP_LED_On(LED_BLUE);
      APP_DBG_MSG("-- APPLICATION SERVER : LED1 ON\n"); 
      MC_CENTRALPERIPHERAL_APP_Context.LedControl.Led1 = 0x01; /* LED1 ON */
    }
    if(p_Notification->DataTransfered.p_Payload[1] == 0x00)
    {
      BSP_LED_Off(LED_BLUE);
      APP_DBG_MSG("-- APPLICATION SERVER : LED1 OFF\n"); 
      MC_CENTRALPERIPHERAL_APP_Context.LedControl.Led1 = 0x00; /* LED1 OFF */
    }
      /* USER CODE END Service1Char1_WRITE_NO_RESP_EVT */
      break;

    case MC_CENTRALPERIPHERAL_SWITCH_C_NOTIFY_ENABLED_EVT:
      /* USER CODE BEGIN Service1Char2_NOTIFY_ENABLED_EVT */
      MC_CENTRALPERIPHERAL_APP_Context.Switch_c_Notification_Status = Switch_c_NOTIFICATION_ON;
      APP_DBG_MSG("-- APPLICATION SERVER : NOTIFICATION ENABLED\n"); 
      APP_DBG_MSG(" \n");
      /* USER CODE END Service1Char2_NOTIFY_ENABLED_EVT */
      break;

    case MC_CENTRALPERIPHERAL_SWITCH_C_NOTIFY_DISABLED_EVT:
      /* USER CODE BEGIN Service1Char2_NOTIFY_DISABLED_EVT */
      MC_CENTRALPERIPHERAL_APP_Context.Switch_c_Notification_Status = Switch_c_NOTIFICATION_OFF;
      APP_DBG_MSG("-- APPLICATION SERVER : NOTIFICATION DISABLED\n"); 
      APP_DBG_MSG(" \n");
      /* USER CODE END Service1Char2_NOTIFY_DISABLED_EVT */
      break;

    default:
      /* USER CODE BEGIN Service1_Notification_default */
    
      /* USER CODE END Service1_Notification_default */
      break;
  }
  /* USER CODE BEGIN Service1_Notification_2 */
  
  /* USER CODE END Service1_Notification_2 */
  return;
}

void MC_CENTRALPERIPHERAL_APP_EvtRx(MC_CENTRALPERIPHERAL_APP_ConnHandleNotEvt_t *p_Notification)
{
  /* USER CODE BEGIN Service1_APP_EvtRx_1 */
  
  /* USER CODE END Service1_APP_EvtRx_1 */

