STMicroelectronics/STM32CubeWB0/Projects/NUCLEO-WB07CC/Applications/BLE/BLE_MultipleConnections_CP/STM32_BLE/App/mc_centralperipheral_app.c
  switch(p_Notification->EvtOpcode)
  {
    /* USER CODE BEGIN Service1_APP_EvtRx_Service1_EvtOpcode */
  case MC_CENTRALPERIPHERAL_PAIRING_ERROR_HANDLE_EVT:
    APP_Context_updatePairingStatus(p_Notification->ConnectionHandle, 0x05);
    break;
  case MC_CENTRALPERIPHERAL_PAIRING_SUCCESS_HANDLE_EVT:
    if(APP_Context_isCentralConnectionHandle(p_Notification->ConnectionHandle))
    {
      ;
    }
    else
    {
      if(APP_Context_isPeripheralConnectionHandle(p_Notification->ConnectionHandle))
      {
        ;
      }
    }
    break;
    /* USER CODE END Service1_APP_EvtRx_Service1_EvtOpcode */
    case MC_CENTRALPERIPHERAL_CENTR_CONN_HANDLE_EVT :
      /* USER CODE BEGIN Service1_APP_CENTR_CONN_HANDLE_EVT */
    if( APP_Context_addConnection(&MC_CENTRALPERIPHERAL_APP_Context, p_Notification->ConnectionHandle, HCI_ROLE_CENTRAL) == -1)
    {
      APP_DBG_MSG("  Fail: APP_Context_addConnection    ConnectionHandle = 0x%04X\n", p_Notification->ConnectionHandle);
    }
    else
    {
      APP_DBG_MSG("  APP_Context_addConnection ConnectionHandle = 0x%04X\n", p_Notification->ConnectionHandle);
    }
      /* USER CODE END Service1_APP_CENTR_CONN_HANDLE_EVT */
      break;

    case MC_CENTRALPERIPHERAL_PERIPH_CONN_HANDLE_EVT :
      /* USER CODE BEGIN Service1_APP_PERIPH_CONN_HANDLE_EVT */
    if( APP_Context_addConnection(&MC_CENTRALPERIPHERAL_APP_Context, p_Notification->ConnectionHandle, HCI_ROLE_PERIPHERAL) == -1)
    {
      APP_DBG_MSG("  Fail: APP_Context_addConnection     ConnectionHandle = 0x%04X \n", p_Notification->ConnectionHandle);
    }
    else
    {
      APP_DBG_MSG("  Success : APP_Context_addConnection     ConnectionHandle = 0x%04X\n", p_Notification->ConnectionHandle);
    }
    
      /* USER CODE END Service1_APP_PERIPH_CONN_HANDLE_EVT */
      break;

    case MC_CENTRALPERIPHERAL_DISCON_HANDLE_EVT :
      /* USER CODE BEGIN Service1_APP_DISCON_HANDLE_EVT */

      if( APP_Context_removeConnection(&MC_CENTRALPERIPHERAL_APP_Context, p_Notification->ConnectionHandle, HCI_ROLE_PERIPHERAL) == -1)
      {
        if( APP_Context_removeConnection(&MC_CENTRALPERIPHERAL_APP_Context, p_Notification->ConnectionHandle, HCI_ROLE_CENTRAL) == -1)
        {
          APP_DBG_MSG("  Fail : APP_Context_removeConnection - Connection handle not found. ConnectionHandle = 0x%04X.\n", p_Notification->ConnectionHandle);
        }
        else
        {
          UTIL_SEQ_SetTask(1U << CFG_TASK_AUTO_CONNECTION_REQUEST, CFG_SEQ_PRIO_0);
        }
      }


      /* USER CODE END Service1_APP_DISCON_HANDLE_EVT */
      break;

    default:
      /* USER CODE BEGIN Service1_APP_EvtRx_default */
    
      /* USER CODE END Service1_APP_EvtRx_default */
      break;
  }

  /* USER CODE BEGIN Service1_APP_EvtRx_2 */
  
  /* USER CODE END Service1_APP_EvtRx_2 */

  return;
}

void MC_CENTRALPERIPHERAL_APP_Init(void)
{
  MC_CENTRALPERIPHERAL_Init();

  /* USER CODE BEGIN Service1_APP_Init */
  APP_Context_init();
  
  UTIL_SEQ_RegTask(1U << CFG_TASK_PERIPHERAL_SECURITY_REQUEST, UTIL_SEQ_RFU, Peripheral_Security_Request);
  UTIL_SEQ_RegTask( 1U << CFG_TASK_SEND_NOTIF_ID, UTIL_SEQ_RFU, MC_CENTRALPERIPHERAL_Switch_c_SendNotification);
  UTIL_SEQ_RegTask(1U << CFG_TASK_TERMINATE_ALL_CENTRAL_CONNECTIONS, UTIL_SEQ_RFU, Terminate_Central_Connections);
  UTIL_SEQ_RegTask(1U << CFG_TASK_TERMINATE_ALL_PERIPHERAL_CONNECTIONS, UTIL_SEQ_RFU, Terminate_Peripheral_Connections);
  
  
  /**
  * Initialize LedButton Service
  */
  MC_CENTRALPERIPHERAL_APP_Context.Switch_c_Notification_Status= Switch_c_NOTIFICATION_OFF;
  MC_CENTRALPERIPHERAL_APP_LED_BUTTON_context_Init();
  /* USER CODE END Service1_APP_Init */
  return;
}

/* USER CODE BEGIN FD */
void MC_CENTRALPERIPHERAL_APP_LED_BUTTON_context_Init(void)
{  
  BSP_LED_Off(LED_BLUE);
  MC_CENTRALPERIPHERAL_APP_Context.LedControl.Device_Led_Selection=0x01; /* Device1 */
  MC_CENTRALPERIPHERAL_APP_Context.LedControl.Led1=0x00; /* led OFF */
  MC_CENTRALPERIPHERAL_APP_Context.ButtonControl.Device_Button_Selection=0x01;/* Device1 */
  MC_CENTRALPERIPHERAL_APP_Context.ButtonControl.ButtonStatus=0x00;
  
  return;
}

/**
* @brief Initialize the context structure.
* 
* @param context Pointer to the context structure to initialize.
*/
void APP_Context_init(void)
{
  for (int i = 0; i < CFG_BLE_NUM_CLIENT_CONTEXTS; i++) 
  {
    MC_CENTRALPERIPHERAL_APP_Context.central_array[i].connectionHandle = 0xFFFF;
    MC_CENTRALPERIPHERAL_APP_Context.central_array[i].pairing_status = 0x0;
  }
  for (int i = 0; i < CFG_BLE_PERIPHERAL_HANDLES_MAX; i++) 
  {
    MC_CENTRALPERIPHERAL_APP_Context.peripheral_array[i].connectionHandle = 0xFFFF;
    MC_CENTRALPERIPHERAL_APP_Context.peripheral_array[i].pairing_status = 0x0;  
  }
}

/**
* @brief Get the number of active connections in the context array.
* 
* @param contextData_Array Array to check for active connections.
* @param maxHandles Maximum number of handles.
* @return int Number of active connections.
*/
int APP_Context_getActiveConnectionCount(ContextData_t* contextData_Array, int maxHandles) 
{
  int count = 0;
  for (int i = 0; i < maxHandles; i++) 
  {
    if (contextData_Array[i].connectionHandle != 0xFFFF) 
    {
      count++;
    }
  }
  return count;
}

int APP_Context_getActiveConnectionCountCentral(void)
{
  return APP_Context_getActiveConnectionCount(MC_CENTRALPERIPHERAL_APP_Context.central_array, CFG_BLE_NUM_CLIENT_CONTEXTS);
}

int APP_Context_getActiveConnectionCountPeripheral(void)
{
  return APP_Context_getActiveConnectionCount(MC_CENTRALPERIPHERAL_APP_Context.peripheral_array, CFG_BLE_PERIPHERAL_HANDLES_MAX);
}

/**
* @brief Find the first free index in the connection handle array.
* 
* @param connHdlArray Array to check for free slots.
* @param maxHandles Maximum number of handles.
* @return int Index of the first free element, or -1 if no free element is found.
*/
int APP_Context_findFirstFreeIndex(ContextData_t* contextData_Array, int maxHandles) 
{
  for (int i = 0; i < maxHandles; i++) 
  {
    if (contextData_Array[i].connectionHandle == 0xFFFF) 
    {
      return i;
    }
  }
  return -1; // No free element found
}
  
/**
* @brief Check if advertising can be started.
* 
* This function uses the findFirstFreeIndex function to determine if there is still space 
* for new handles in the peripheral array. If there are free indices, it means that 
* advertising can be started; otherwise, all slots are occupied.
* 
* @return int -1 if advertising cannot be started, other values if advertising can be started.
*/
int APP_Context_canStartAdvertising(void) 
{
  return APP_Context_findFirstFreeIndex(MC_CENTRALPERIPHERAL_APP_Context.peripheral_array, CFG_BLE_PERIPHERAL_HANDLES_MAX); 
}

/**
* @brief Check if scanning can be started.
* 
* This function uses the findFirstFreeIndex function to determine if there is still space 
* for new handles in the central array. If there are free indices, it means that 
* scanning can be started; otherwise, all slots are occupied.
* 
* @return int -1 if scanning cannot be started, other values if scanning can be started.
*/
int APP_Context_canStartScanning(void) 
{
  return APP_Context_findFirstFreeIndex(MC_CENTRALPERIPHERAL_APP_Context.central_array, CFG_BLE_NUM_CLIENT_CONTEXTS);
}

/**
* @brief Add a new connection handle to the context.
* 
* This function adds a new connection handle to the appropriate context array 
* (either peripheral or central) and updates the GATT client context if the 
* connection is for a central device.
*
* @param context Pointer to the context structure.
* @param connHdl Connection handle to add.
* @param isRolePeripheral Flag indicating if the connection is for a peripheral device.
* @return int 0 if the connection handle was added successfully, -1 if no free space is available.
*/
int APP_Context_addConnection(MC_CENTRALPERIPHERAL_APP_Context_t* context, uint16_t connHdl, int isRolePeripheral)
{
  ContextData_t* contextDataArray = isRolePeripheral ? context->peripheral_array : context->central_array;
  int maxHandles = isRolePeripheral ? CFG_BLE_PERIPHERAL_HANDLES_MAX : CFG_BLE_NUM_CLIENT_CONTEXTS;
  
  int index = APP_Context_findFirstFreeIndex(contextDataArray, maxHandles);
  if (index == -1) 
  {
    return -1; // No free space available
  }
  contextDataArray[index].connectionHandle = connHdl;
  
  contextDataArray[index].pairing_status = 0x1;
  if(!isRolePeripheral)
  {
    GATT_CLIENT_APP_ConnHandle_Notif_evt_t notif;
    /* Role: Central */
    /* When the central role completes a connection with a peripheral, it is mandatory to update the GATT client context with the new connection handle */
    notif.ConnOpcode = PEER_CONN_HANDLE_EVT;
    notif.ConnHdl = connHdl;
    GATT_CLIENT_APP_Notification(&notif);
  }
  APP_Context_printContextArrays();
  return 0;
}

/**
* @brief Remove a connection handle from the context.
* 
* @param context Pointer to the context structure.
* @param connHdl Connection handle to remove.
* @param isRolePeripheral Flag indicating if the connection is for a peripheral device.
* @return int 0 if the connection handle was removed successfully, -1 if the connection handle was not found.
*/
int APP_Context_removeConnection(MC_CENTRALPERIPHERAL_APP_Context_t* context, uint16_t connHdl, int isRolePeripheral)
{
  ContextData_t* contextDataArray = isRolePeripheral ? context->peripheral_array : context->central_array;
  int maxHandles = isRolePeripheral ? CFG_BLE_PERIPHERAL_HANDLES_MAX : CFG_BLE_NUM_CLIENT_CONTEXTS;
  
  for (int index = 0; index < maxHandles; index++) 
  {
    if (contextDataArray[index].connectionHandle == connHdl) 
    {
      contextDataArray[index].connectionHandle = 0xFFFF;
      contextDataArray[index].pairing_status = 0x0;
      if(!isRolePeripheral)
      {
        GATT_CLIENT_APP_ConnHandle_Notif_evt_t notif;
        /* Role: Central */
        /* When the central role completes a disconnection with a peripheral, it is mandatory to update the GATT client context removing the old connection handle */
        notif.ConnOpcode = PEER_DISCON_HANDLE_EVT;
        notif.ConnHdl = connHdl;
        GATT_CLIENT_APP_Notification(&notif);
      }
      APP_Context_printContextArrays();
      return 0;
    }
  }
  return -1; // Connection handle not found
}

/**
 * @brief Update the pairing status for a given connection handle.
 * 
 * This function updates the pairing status to the specified new status for the given connection handle
 * in either the central or peripheral array within the context.
 * 
 * @param connHdl Connection handle for which the pairing status needs to be updated.
 * @param newStatus The new pairing status to be set.
 * @return int 0 if the pairing status was updated successfully, -1 if the connection handle was not found.
 */
int APP_Context_updatePairingStatus(uint16_t connHdl, uint8_t newStatus)
{
  for (int i = 0; i < CFG_BLE_NUM_CLIENT_CONTEXTS; i++)
  {
    if(MC_CENTRALPERIPHERAL_APP_Context.central_array[i].connectionHandle == connHdl)
    {
      MC_CENTRALPERIPHERAL_APP_Context.central_array[i].pairing_status = newStatus;
      return 0;
    }
  }
  
  for (int i = 0; i < CFG_BLE_PERIPHERAL_HANDLES_MAX; i++)
  {
    if(MC_CENTRALPERIPHERAL_APP_Context.peripheral_array[i].connectionHandle == connHdl)
    {
      MC_CENTRALPERIPHERAL_APP_Context.peripheral_array[i].pairing_status = newStatus;
      return 0;
    }
  }
  return -1; // Connection handle not found
}

/**
 * @brief Check if a connection handle exists in the context.
 * 
 * This function checks if the specified connection handle exists in either the central or peripheral array within the context.
 * 
 * @param context Pointer to the context structure.
 * @param connHdl Connection handle to check.
 * @param isRolePeripheral Flag indicating if the connection is for a peripheral device.
 * @return int 1 if the connection handle exists, 0 if the connection handle was not found.
 */
int APP_Context_isConnectionHandle(MC_CENTRALPERIPHERAL_APP_Context_t* context, uint16_t connHdl, int isRolePeripheral)
{
  ContextData_t* contextDataArray = isRolePeripheral ? context->peripheral_array : context->central_array;
  int maxHandles = isRolePeripheral ? CFG_BLE_PERIPHERAL_HANDLES_MAX : CFG_BLE_NUM_CLIENT_CONTEXTS;
  
  for (int i = 0; i < maxHandles; i++) 
  {
    if (contextDataArray[i].connectionHandle == connHdl) 
    {
      return 1;
    }
  }
  return 0; // Connection handle not found
}

/**
 * @brief Check if a connection handle exists in the central array.
 * 
 * This function checks if the specified connection handle exists in the central array within the context.
 * 
 * @param connHdl Connection handle to check.
 * @return int 0 if the connection handle exists, -1 if the connection handle was not found.
 */
int APP_Context_isCentralConnectionHandle(uint16_t connHdl)
{
  return APP_Context_isConnectionHandle(&MC_CENTRALPERIPHERAL_APP_Context, connHdl, HCI_ROLE_CENTRAL);
}

/**
 * @brief Check if a connection handle exists in the peripheral array.
 * 
 * This function checks if the specified connection handle exists in the peripheral array within the context.
 * 
 * @param connHdl Connection handle to check.
 * @return int 0 if the connection handle exists, -1 if the connection handle was not found.
 */
int APP_Context_isPeripheralConnectionHandle(uint16_t connHdl)
{
  return APP_Context_isConnectionHandle(&MC_CENTRALPERIPHERAL_APP_Context, connHdl, HCI_ROLE_PERIPHERAL); 
}


/**
 * @brief Prints the values of central_array and peripheral_array in the given context.
 * 
 * @param context The context containing the arrays to be printed.
 */
void APP_Context_printContextArrays(void) {
  printf("\tCentral Array:\n");
  for (int i = 0; i < CFG_BLE_NUM_CLIENT_CONTEXTS; i++)
  {
    printf("\tCentral[%d]: ConnectionHandle = 0x%04X, PairingStatus = 0x%02X\n", 
           i, MC_CENTRALPERIPHERAL_APP_Context.central_array[i].connectionHandle, MC_CENTRALPERIPHERAL_APP_Context.central_array[i].pairing_status);
  }

  printf("\tPeripheral Array:\n");
  for (int i = 0; i < CFG_BLE_PERIPHERAL_HANDLES_MAX; i++)
  {
    printf("\tPeripheral[%d]: ConnectionHandle = 0x%04X, PairingStatus = 0x%02X\n", 
           i, MC_CENTRALPERIPHERAL_APP_Context.peripheral_array[i].connectionHandle, MC_CENTRALPERIPHERAL_APP_Context.peripheral_array[i].pairing_status);
  }
}

/**
* @brief Terminates connections.
* 
* This function terminates the current BLE connections with the error message BLE_ERROR_TERMINATED_LOCAL_HOST.
* It iterates through the connection handles in the provided context and terminates each active connection.
* 
* @param context Pointer to the application context containing the connection handles.
* @param isRolePeripheral Flag indicating whether the role is peripheral (HCI_ROLE_PERIPHERAL) or central (HCI_ROLE_CENTRAL). Numeric values for the role are peripheral (1) or central (0).
* 
* @retval void
*/
static void Terminate_Connections(MC_CENTRALPERIPHERAL_APP_Context_t* context, int isRolePeripheral)
{
  ContextData_t* contextDataArray = isRolePeripheral ? context->peripheral_array : context->central_array;
  int maxHandles = isRolePeripheral ? CFG_BLE_PERIPHERAL_HANDLES_MAX : CFG_BLE_NUM_CLIENT_CONTEXTS;
  
  for (int i = 0; i < maxHandles; i++) 
  {
    if (contextDataArray[i].connectionHandle != 0xFFFF) 
    {
      APP_DBG_MSG("aci_gap_terminate init: connectionHandle=0x%04X\n", contextDataArray[i].connectionHandle);
      uint32_t status = aci_gap_terminate(contextDataArray[i].connectionHandle, BLE_ERROR_TERMINATED_REMOTE_USER);
      
      /* Check if the termination command was successful */
      if (status != BLE_STATUS_SUCCESS)
      {
        APP_DBG_MSG("aci_gap_terminate failure: reason=0x%02X\n", status);
      }
      else
      {
        APP_DBG_MSG("==>> aci_gap_terminate : Success\n");
        
        /* Wait for the HCI_DISCONNECTION_COMPLETE_EVT_CODE event */
        UTIL_SEQ_WaitEvt(1 << CFG_IDLEEVT_PROC_GAP_COMPLETE);
      }
    }
  }
  return;
}

/**
* @brief Terminates all peripheral connections.
* 
* This function is the specific implementation for CFG_TASK_TERMINATE_ALL_PERIPHERAL_CONNECTIONS.
* It terminates all current BLE connections for peripheral devices with the error message BLE_ERROR_TERMINATED_LOCAL_HOST.
* 
* @retval void
*/
static void Terminate_Peripheral_Connections(void)
{
  Terminate_Connections(&MC_CENTRALPERIPHERAL_APP_Context, HCI_ROLE_PERIPHERAL);
}

/**
* @brief Terminates all central connections.
* 
* This function is the specific implementation for CFG_TASK_TERMINATE_ALL_CENTRAL_CONNECTIONS.
* It terminates all current BLE connections for central devices with the error message BLE_ERROR_TERMINATED_LOCAL_HOST.
* 
* @retval void
*/
static void Terminate_Central_Connections(void)
{
  Terminate_Connections(&MC_CENTRALPERIPHERAL_APP_Context, HCI_ROLE_CENTRAL);
}

/**
* @brief Handle the security request task.
*/
static void Peripheral_Security_Request(void)
{
  /* Specific implementation for CFG_TASK_PERIPHERAL_SECURITY_REQUEST */
  uint8_t status = 0;
  
  /**  
  * @note BLE Security Levels and Dependencies:
  *       - GAP_SECURITY_LEVEL_1: No security (no authentication or encryption).
  *          - No MITM protection required.
  *          - No dependency on IO_CAPABILITY.
  *       - GAP_SECURITY_LEVEL_2: Unauthenticated pairing with encryption.
  *          - No MITM protection required.
  *          - No dependency on IO_CAPABILITY.
  *       - GAP_SECURITY_LEVEL_3: Authenticated pairing with encryption.
  *          - MITM protection required.
  *          - Depends on IO_CAPABILITY for pairing method (e.g., Passkey Entry, Numeric Comparison).
  *       - GAP_SECURITY_LEVEL_4: Authenticated LE Secure Connections pairing with encryption using a 128-bit strength encryption key.
  *          - MITM protection required.
  *          - Depends on IO_CAPABILITY for pairing method (e.g., Numeric Comparison, Passkey Entry).
  */ 
  
  for( uint8_t i=0; i<CFG_BLE_PERIPHERAL_HANDLES_MAX; i++)
  {
    if(MC_CENTRALPERIPHERAL_APP_Context.peripheral_array[i].pairing_status == 0x01 || MC_CENTRALPERIPHERAL_APP_Context.peripheral_array[i].pairing_status == 0x05)
    {
      MC_CENTRALPERIPHERAL_APP_Context.peripheral_array[i].pairing_status = 0x02;
      APP_DBG_MSG("   Init   : Pairing request [0x%04X]\n", MC_CENTRALPERIPHERAL_APP_Context.peripheral_array[i].connectionHandle);
      status = aci_gap_set_security(MC_CENTRALPERIPHERAL_APP_Context.peripheral_array[i].connectionHandle,
                                    GAP_SECURITY_LEVEL_2,
                                    0x01);
      if (status != BLE_STATUS_SUCCESS)
      {
        MC_CENTRALPERIPHERAL_APP_Context.peripheral_array[i].pairing_status = 0x03;
        APP_DBG_MSG("  Fail   : Pairing request 0x%02X  [0x%04X]\n", status, MC_CENTRALPERIPHERAL_APP_Context.peripheral_array[i].connectionHandle);
      }
      else
      {
        MC_CENTRALPERIPHERAL_APP_Context.peripheral_array[i].pairing_status = 0x04;
        APP_DBG_MSG("  Success: Pairing request [0x%04X]\n", MC_CENTRALPERIPHERAL_APP_Context.peripheral_array[i].connectionHandle);
        //BLEStack_Process_Schedule();
      }
    }
  }
  
  status = aci_gap_configure_filter_accept_and_resolving_list(0x01 | 0x02);
  
  if (status != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("  Fail   : aci_gap_configure_filter_accept_and_resolving_list(), error:0x%02X\n", status);
  }
  else
  {
    APP_DBG_MSG("  Success: aci_gap_configure_filter_accept_and_resolving_list\n");
  }
  

  UTIL_SEQ_SetTask(1U << CFG_TASK_START_ADVERTISE_NON_DISCOVERY_MODE, CFG_SEQ_PRIO_1);  
  
  return;
}

/* USER CODE END FD */

