STMicroelectronics/STM32CubeWB0/Projects/NUCLEO-WB07CC/Applications/BLE/BLE_MultipleConnections_CP/STM32_BLE/App/mc_centralperipheral_app.c
/*************************************************************
 *
 * LOCAL FUNCTIONS
 *
 *************************************************************/
__USED void MC_CENTRALPERIPHERAL_Switch_c_SendNotification(void) /* Property Notification */
{
  MC_CENTRALPERIPHERAL_APP_SendInformation_t notification_on_off = Switch_c_NOTIFICATION_OFF;
  MC_CENTRALPERIPHERAL_Data_t mc_centralperipheral_notification_data;

  mc_centralperipheral_notification_data.p_Payload = (uint8_t*)a_MC_CENTRALPERIPHERAL_UpdateCharData;
  mc_centralperipheral_notification_data.Length = 0;

  /* USER CODE BEGIN Service1Char2_NS_1*/
  
  if(MC_CENTRALPERIPHERAL_APP_Context.ButtonControl.ButtonStatus == 0x00)
  {
    MC_CENTRALPERIPHERAL_APP_Context.ButtonControl.ButtonStatus = 0x01;
  } 
  else
  {
    MC_CENTRALPERIPHERAL_APP_Context.ButtonControl.ButtonStatus = 0x00;
  }
  a_MC_CENTRALPERIPHERAL_UpdateCharData[0] = 0x01; /* Device Led selection */
  a_MC_CENTRALPERIPHERAL_UpdateCharData[1] = MC_CENTRALPERIPHERAL_APP_Context.ButtonControl.ButtonStatus;
  /* Update notification data length */
  mc_centralperipheral_notification_data.Length = (mc_centralperipheral_notification_data.Length) + 2; 
  
  if(MC_CENTRALPERIPHERAL_APP_Context.Switch_c_Notification_Status == Switch_c_NOTIFICATION_ON)
  { 
    //APP_DBG_MSG("-- APPLICATION SERVER : INFORM CLIENT - NOTIFICATION ENABLED\n");
    notification_on_off = Switch_c_NOTIFICATION_ON;
  } 
  else
  {
    APP_DBG_MSG("-- APPLICATION SERVER : CAN'T INFORM CLIENT - NOTIFICATION DISABLED\n"); 
  } 

  if (notification_on_off != Switch_c_NOTIFICATION_OFF)
  {
    for(uint16_t i=0; i<CFG_BLE_PERIPHERAL_HANDLES_MAX; i++)
    {
      if(MC_CENTRALPERIPHERAL_APP_Context.peripheral_array[i].connectionHandle != 0xFFFF)
      {
        APP_DBG_MSG("-- APPLICATION SERVER : INFORM CLIENT [0x%04X]\n", MC_CENTRALPERIPHERAL_APP_Context.peripheral_array[i].connectionHandle);
        MC_CENTRALPERIPHERAL_NotifyValue(MC_CENTRALPERIPHERAL_SWITCH_C, &mc_centralperipheral_notification_data, MC_CENTRALPERIPHERAL_APP_Context.peripheral_array[i].connectionHandle);
      }
    }
    return;
  }
  /* USER CODE END Service1Char2_NS_1*/

  if (notification_on_off != Switch_c_NOTIFICATION_OFF && MC_CENTRALPERIPHERAL_APP_Context.MC_CENTRALPERIPHERAL_periph_connHdl != 0xFFFF)
  {
    MC_CENTRALPERIPHERAL_NotifyValue(MC_CENTRALPERIPHERAL_SWITCH_C, &mc_centralperipheral_notification_data, MC_CENTRALPERIPHERAL_APP_Context.MC_CENTRALPERIPHERAL_periph_connHdl);
  }

  /* USER CODE BEGIN Service1Char2_NS_Last*/
  
  /* USER CODE END Service1Char2_NS_Last*/

  return;
}

/* USER CODE BEGIN FD_LOCAL_FUNCTIONS*/

/* USER CODE END FD_LOCAL_FUNCTIONS*/
